*** crates/nestweaver-daemon/src/lifecycle.rs:12:50: replace * with +

*** mutation diff:
--- crates/nestweaver-daemon/src/lifecycle.rs
+++ replace * with +
@@ -4,17 +4,17 @@
 
 use serde::{Deserialize, Serialize};
 
 pub const EFFECTIVE_CONFIG_BINDING_VERSION: u32 = 1;
 const EFFECTIVE_CONFIG_BINDING_FILE: &str = "effective-config.json";
 const EFFECTIVE_CONFIG_BINDING_MAX_BYTES: u64 = 64 * 1024;
 pub const LAST_SUCCESSFUL_CONFIG_VERSION: u32 = 1;
 const LAST_SUCCESSFUL_CONFIG_FILE: &str = "last-successful-config.json";
-const LAST_SUCCESSFUL_CONFIG_MAX_BYTES: u64 = 64 * 1024;
+const LAST_SUCCESSFUL_CONFIG_MAX_BYTES: u64 = 64 + /* ~ changed by cargo-mutants ~ */ 1024;
 static EFFECTIVE_CONFIG_TEMP_SEQUENCE: std::sync::atomic::AtomicU64 =
     std::sync::atomic::AtomicU64::new(0);
 static LAST_SUCCESSFUL_CONFIG_TEMP_SEQUENCE: std::sync::atomic::AtomicU64 =
     std::sync::atomic::AtomicU64::new(0);
 /// Process-local proof that this daemon was started through NestWeaver's
 /// managed `daemon start` path. Unlike an environment variable, an external
 /// supervisor cannot accidentally inherit or forge this marker. The command
 /// sets it only after acquiring or validating the locked spawn descriptor.

*** result: Success
