*** crates/nestweaver-daemon/src/lifecycle.rs:12:50: replace * with /

*** mutation diff:
--- crates/nestweaver-daemon/src/lifecycle.rs
+++ replace * with /
@@ -4,17 +4,17 @@
 
 use serde::{Deserialize, Serialize};
 
 pub const EFFECTIVE_CONFIG_BINDING_VERSION: u32 = 1;
 const EFFECTIVE_CONFIG_BINDING_FILE: &str = "effective-config.json";
 const EFFECTIVE_CONFIG_BINDING_MAX_BYTES: u64 = 64 * 1024;
 pub const LAST_SUCCESSFUL_CONFIG_VERSION: u32 = 1;
 const LAST_SUCCESSFUL_CONFIG_FILE: &str = "last-successful-config.json";
-const LAST_SUCCESSFUL_CONFIG_MAX_BYTES: u64 = 64 * 1024;
+const LAST_SUCCESSFUL_CONFIG_MAX_BYTES: u64 = 64 / /* ~ changed by cargo-mutants ~ */ 1024;
 static EFFECTIVE_CONFIG_TEMP_SEQUENCE: std::sync::atomic::AtomicU64 =
     std::sync::atomic::AtomicU64::new(0);
 static LAST_SUCCESSFUL_CONFIG_TEMP_SEQUENCE: std::sync::atomic::AtomicU64 =
     std::sync::atomic::AtomicU64::new(0);
 /// Process-local proof that this daemon was started through NestWeaver's
 /// managed `daemon start` path. Unlike an environment variable, an external
 /// supervisor cannot accidentally inherit or forge this marker. The command
 /// sets it only after acquiring or validating the locked spawn descriptor.

---- lifecycle::tests::last_successful_config_enforces_private_modes_and_fingerprint stdout ----

thread 'lifecycle::tests::last_successful_config_enforces_private_modes_and_fingerprint' (27466088) panicked at crates/nestweaver-daemon/src/lifecycle.rs:3074:63:
called `Result::unwrap()` on an `Err` value: TooLarge { path: "/var/folders/wy/f399vst543dbrw08w_y3wmh00000gn/T/.tmpwmajLq/nestweaver/config-intent/669c8e58ab203953071019ebfd26d3ceaf3133748d5b91d82c4871b89206ee6e/last-successful-config.json", size: 214, max: 0 }

---- lifecycle::tests::last_successful_config_is_isolated_and_survives_live_binding_cleanup stdout ----

thread 'lifecycle::tests::last_successful_config_is_isolated_and_survives_live_binding_cleanup' (27466097) panicked at crates/nestweaver-daemon/src/lifecycle.rs:3048:13:
assertion failed: read_last_successful_config(&first).is_ok()

---- lifecycle::tests::last_successful_config_rejects_corrupt_version_oversize_and_symlink stdout ----

thread 'lifecycle::tests::last_successful_config_rejects_corrupt_version_oversize_and_symlink' (27466100) panicked at crates/nestweaver-daemon/src/lifecycle.rs:3121:13:
assertion failed: matches!(read_last_successful_config(&db),
    Err(LastSuccessfulConfigError::Corrupt { .. }))

failures:
    lifecycle::tests::last_successful_config_enforces_private_modes_and_fingerprint
    lifecycle::tests::last_successful_config_is_isolated_and_survives_live_binding_cleanup
    lifecycle::tests::last_successful_config_rejects_corrupt_version_oversize_and_symlink
    lifecycle::tests::last_successful_config_roundtrips_with_full_path_identity

test result: FAILED. 277 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 22.92s

*** result: Failure(101)
