*** crates/nestweaver-daemon/src/lifecycle.rs:29:5: replace clear_verified_nestweaver_managed_start with ()

*** mutation diff:
--- crates/nestweaver-daemon/src/lifecycle.rs
+++ replace clear_verified_nestweaver_managed_start with ()
@@ -21,17 +21,17 @@
 static VERIFIED_NESTWEAVER_MANAGED_START: std::sync::atomic::AtomicBool =
     std::sync::atomic::AtomicBool::new(false);
 
 pub fn mark_verified_nestweaver_managed_start() {
     VERIFIED_NESTWEAVER_MANAGED_START.store(true, std::sync::atomic::Ordering::Release);
 }
 
 pub fn clear_verified_nestweaver_managed_start() {
-    VERIFIED_NESTWEAVER_MANAGED_START.store(false, std::sync::atomic::Ordering::Release);
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn is_verified_nestweaver_managed_start() -> bool {
     VERIFIED_NESTWEAVER_MANAGED_START.load(std::sync::atomic::Ordering::Acquire)
 }
 
 /// Process-wide lock serializing every test that swaps OR durably reads the
 /// XDG/socket-fallback env vars. Defined at module level (not inside the

*** result: Success
