*** crates/nestweaver-daemon/src/lifecycle.rs:33:5: replace is_verified_nestweaver_managed_start -> bool with false

*** mutation diff:
--- crates/nestweaver-daemon/src/lifecycle.rs
+++ replace is_verified_nestweaver_managed_start -> bool with false
@@ -25,17 +25,17 @@
     VERIFIED_NESTWEAVER_MANAGED_START.store(true, std::sync::atomic::Ordering::Release);
 }
 
 pub fn clear_verified_nestweaver_managed_start() {
     VERIFIED_NESTWEAVER_MANAGED_START.store(false, std::sync::atomic::Ordering::Release);
 }
 
 pub fn is_verified_nestweaver_managed_start() -> bool {
-    VERIFIED_NESTWEAVER_MANAGED_START.load(std::sync::atomic::Ordering::Acquire)
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Process-wide lock serializing every test that swaps OR durably reads the
 /// XDG/socket-fallback env vars. Defined at module level (not inside the
 /// test module) so `server.rs`'s in-process-daemon e2e tests — which resolve
 /// runtime/state paths for the daemon's whole lifetime — can serialize
 /// against the lifecycle unit tests that flip those vars.
 #[cfg(test)]

*** result: Success
