*** crates/nestweaver-daemon/src/lifecycle.rs:45:5: replace effective_config_temp_path -> PathBuf with Default::default()

*** mutation diff:
--- crates/nestweaver-daemon/src/lifecycle.rs
+++ replace effective_config_temp_path -> PathBuf with Default::default()
@@ -37,21 +37,17 @@
 /// XDG/socket-fallback env vars. Defined at module level (not inside the
 /// test module) so `server.rs`'s in-process-daemon e2e tests — which resolve
 /// runtime/state paths for the daemon's whole lifetime — can serialize
 /// against the lifecycle unit tests that flip those vars.
 #[cfg(test)]
 pub(crate) static TEST_ENV_LOCK: std::sync::Mutex<()> = std::sync::Mutex::new(());
 
 fn effective_config_temp_path(parent: &Path, sequence: u64) -> PathBuf {
-    parent.join(format!(
-        ".{EFFECTIVE_CONFIG_BINDING_FILE}.{}.{}.tmp",
-        std::process::id(),
-        sequence
-    ))
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn last_successful_config_temp_path(parent: &Path, sequence: u64) -> PathBuf {
     parent.join(format!(
         ".{LAST_SUCCESSFUL_CONFIG_FILE}.{}.{}.tmp",
         std::process::id(),
         sequence
     ))

---- lifecycle::tests::effective_config_binding_is_private_on_unix stdout ----

thread 'lifecycle::tests::effective_config_binding_is_private_on_unix' (27497239) panicked at crates/nestweaver-daemon/src/lifecycle.rs:3329:69:
called `Result::unwrap()` on an `Err` value: Write { path: "/var/folders/wy/f399vst543dbrw08w_y3wmh00000gn/T/.tmpGtqvA1/nestweaver/permissions/effective-config.json", source: Os { code: 2, kind: NotFound, message: "No such file or directory" } }

---- lifecycle::tests::effective_config_binding_reader_rejects_unsafe_mode_and_oversize stdout ----

thread 'lifecycle::tests::effective_config_binding_reader_rejects_unsafe_mode_and_oversize' (27497241) panicked at crates/nestweaver-daemon/src/lifecycle.rs:3381:64:
called `Result::unwrap()` on an `Err` value: Write { path: "/var/folders/wy/f399vst543dbrw08w_y3wmh00000gn/T/.tmpI0WChE/nestweaver/unsafe/effective-config.json", source: Os { code: 2, kind: NotFound, message: "No such file or directory" } }

---- lifecycle::tests::effective_config_binding_paths_are_isolated_per_instance stdout ----

thread 'lifecycle::tests::effective_config_binding_paths_are_isolated_per_instance' (27497240) panicked at crates/nestweaver-daemon/src/lifecycle.rs:3185:74:
called `Result::unwrap()` on an `Err` value: Write { path: "/var/folders/wy/f399vst543dbrw08w_y3wmh00000gn/T/.tmpAn2pJc/nestweaver/instance-a/effective-config.json", source: Os { code: 2, kind: NotFound, message: "No such file or directory" } }

failures:
    lifecycle::tests::effective_config_binding_is_private_on_unix
    lifecycle::tests::effective_config_binding_paths_are_isolated_per_instance
    lifecycle::tests::effective_config_binding_reader_rejects_unsafe_mode_and_oversize
    lifecycle::tests::effective_config_binding_replacement_leaves_one_complete_record
    lifecycle::tests::effective_config_binding_reports_absent_corrupt_version_and_pid_errors
    lifecycle::tests::effective_config_binding_retries_stale_temp_name_collision
    lifecycle::tests::effective_config_binding_roundtrips_configured_and_defaults
    lifecycle::tests::legacy_runtime_cleanup_removes_effective_config_binding
    lifecycle::tests::retiring_a_superseded_identity_removes_its_runtime_artifacts
    lifecycle::tests::retiring_is_a_no_op_when_the_identity_did_not_change
    server::boot_reconciliation_tests::read_write_daemon_boot_recovers_the_aband

test result: FAILED. 268 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 38.28s

*** result: Failure(101)
