*** crates/nestweaver-daemon/src/lifecycle.rs:53:5: replace last_successful_config_temp_path -> PathBuf with Default::default()

*** mutation diff:
--- crates/nestweaver-daemon/src/lifecycle.rs
+++ replace last_successful_config_temp_path -> PathBuf with Default::default()
@@ -45,21 +45,17 @@
     parent.join(format!(
         ".{EFFECTIVE_CONFIG_BINDING_FILE}.{}.{}.tmp",
         std::process::id(),
         sequence
     ))
 }
 
 fn last_successful_config_temp_path(parent: &Path, sequence: u64) -> PathBuf {
-    parent.join(format!(
-        ".{LAST_SUCCESSFUL_CONFIG_FILE}.{}.{}.tmp",
-        std::process::id(),
-        sequence
-    ))
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn last_successful_config_backup_path(parent: &Path, sequence: u64) -> PathBuf {
     parent.join(format!(
         ".{LAST_SUCCESSFUL_CONFIG_FILE}.{}.{}.bak",
         std::process::id(),
         sequence
     ))

---- lifecycle::tests::last_successful_config_enforces_private_modes_and_fingerprint stdout ----

thread 'lifecycle::tests::last_successful_config_enforces_private_modes_and_fingerprint' (27500435) panicked at crates/nestweaver-daemon/src/lifecycle.rs:3058:56:

---- lifecycle::tests::last_successful_config_is_isolated_and_survives_live_binding_cleanup stdout ----

thread 'lifecycle::tests::last_successful_config_is_isolated_and_survives_live_binding_cleanup' (27500436) panicked at crates/nestweaver-daemon/src/lifecycle.rs:3035:59:

---- lifecycle::tests::last_successful_config_rejects_corrupt_version_oversize_and_symlink stdout ----

thread 'lifecycle::tests::last_successful_config_rejects_corrupt_version_oversize_and_symlink' (27500437) panicked at crates/nestweaver-daemon/src/lifecycle.rs:3113:56:

failures:
    lifecycle::tests::last_successful_config_enforces_private_modes_and_fingerprint
    lifecycle::tests::last_successful_config_is_isolated_and_survives_live_binding_cleanup
    lifecycle::tests::last_successful_config_rejects_corrupt_version_oversize_and_symlink
    lifecycle::tests::last_successful_config_remove_is_idempotent
    lifecycle::tests::last_successful_config_roundtrips_with_full_path_identity

test result: FAILED. 276 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 23.23s

*** result: Failure(101)
