*** crates/nestweaver-daemon/src/lifecycle.rs:78:5: replace identity_db_path -> PathBuf with Default::default()

*** mutation diff:
--- crates/nestweaver-daemon/src/lifecycle.rs
+++ replace identity_db_path -> PathBuf with Default::default()
@@ -70,19 +70,17 @@
 /// Identity must survive a publication cutover, so it is anchored to the
 /// stable base database rather than the currently-selected slot. See
 /// [`nestweaver_engine::publication::instance_anchor_database`] (nw-145).
 ///
 /// Deliberately NOT used by the write-lock probe, which must open the real
 /// selected graph, nor by [`legacy_instance_id_from_db_path`], which has to
 /// reproduce a historical hash exactly in order to clean up after it.
 fn identity_db_path(db_path: &Path) -> PathBuf {
-    canonical_db_path(&nestweaver_engine::publication::instance_anchor_database(
-        db_path,
-    ))
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Full, stable identity of a database path for persistent local state.
 ///
 /// Unlike [`instance_id_from_db_path`], this is never truncated for a unix
 /// socket limit. Database contents are deliberately excluded: replacing or
 /// updating the database at the same canonical path keeps the same local
 /// startup intent.


