*** crates/nestweaver-daemon/src/lifecycle.rs:9:52: replace * with +

*** mutation diff:
--- crates/nestweaver-daemon/src/lifecycle.rs
+++ replace * with +
@@ -1,17 +1,17 @@
 //! Utility functions for daemon runtime paths (socket, pidfile, logs).
 
 use std::path::{Path, PathBuf};
 
 use serde::{Deserialize, Serialize};
 
 pub const EFFECTIVE_CONFIG_BINDING_VERSION: u32 = 1;
 const EFFECTIVE_CONFIG_BINDING_FILE: &str = "effective-config.json";
-const EFFECTIVE_CONFIG_BINDING_MAX_BYTES: u64 = 64 * 1024;
+const EFFECTIVE_CONFIG_BINDING_MAX_BYTES: u64 = 64 + /* ~ changed by cargo-mutants ~ */ 1024;
 pub const LAST_SUCCESSFUL_CONFIG_VERSION: u32 = 1;
 const LAST_SUCCESSFUL_CONFIG_FILE: &str = "last-successful-config.json";
 const LAST_SUCCESSFUL_CONFIG_MAX_BYTES: u64 = 64 * 1024;
 static EFFECTIVE_CONFIG_TEMP_SEQUENCE: std::sync::atomic::AtomicU64 =
     std::sync::atomic::AtomicU64::new(0);
 static LAST_SUCCESSFUL_CONFIG_TEMP_SEQUENCE: std::sync::atomic::AtomicU64 =
     std::sync::atomic::AtomicU64::new(0);
 /// Process-local proof that this daemon was started through NestWeaver's

*** result: Success
