*** crates/nestweaver-daemon/src/lifecycle.rs:9:52: replace * with /

*** mutation diff:
--- crates/nestweaver-daemon/src/lifecycle.rs
+++ replace * with /
@@ -1,17 +1,17 @@
 //! Utility functions for daemon runtime paths (socket, pidfile, logs).
 
 use std::path::{Path, PathBuf};
 
 use serde::{Deserialize, Serialize};
 
 pub const EFFECTIVE_CONFIG_BINDING_VERSION: u32 = 1;
 const EFFECTIVE_CONFIG_BINDING_FILE: &str = "effective-config.json";
-const EFFECTIVE_CONFIG_BINDING_MAX_BYTES: u64 = 64 * 1024;
+const EFFECTIVE_CONFIG_BINDING_MAX_BYTES: u64 = 64 / /* ~ changed by cargo-mutants ~ */ 1024;
 pub const LAST_SUCCESSFUL_CONFIG_VERSION: u32 = 1;
 const LAST_SUCCESSFUL_CONFIG_FILE: &str = "last-successful-config.json";
 const LAST_SUCCESSFUL_CONFIG_MAX_BYTES: u64 = 64 * 1024;
 static EFFECTIVE_CONFIG_TEMP_SEQUENCE: std::sync::atomic::AtomicU64 =
     std::sync::atomic::AtomicU64::new(0);
 static LAST_SUCCESSFUL_CONFIG_TEMP_SEQUENCE: std::sync::atomic::AtomicU64 =
     std::sync::atomic::AtomicU64::new(0);
 /// Process-local proof that this daemon was started through NestWeaver's

---- lifecycle::tests::effective_config_binding_paths_are_isolated_per_instance stdout ----

thread 'lifecycle::tests::effective_config_binding_paths_are_isolated_per_instance' (27455728) panicked at crates/nestweaver-daemon/src/lifecycle.rs:3192:61:
called `Result::unwrap()` on an `Err` value: TooLarge { path: "/var/folders/wy/f399vst543dbrw08w_y3wmh00000gn/T/.tmpLWfhmO/nestweaver/instance-a/effective-config.json", size: 139, max: 0 }

---- lifecycle::tests::effective_config_binding_replacement_leaves_one_complete_record stdout ----

thread 'lifecycle::tests::effective_config_binding_replacement_leaves_one_complete_record' (27455742) panicked at crates/nestweaver-daemon/src/lifecycle.rs:3285:69:
called `Result::unwrap()` on an `Err` value: TooLarge { path: "/var/folders/wy/f399vst543dbrw08w_y3wmh00000gn/T/.tmpbGbpjw/nestweaver/replace/effective-config.json", size: 160, max: 0 }

---- lifecycle::tests::effective_config_binding_reports_absent_corrupt_version_and_pid_errors stdout ----

thread 'lifecycle::tests::effective_config_binding_reports_absent_corrupt_version_and_pid_errors' (27455744) panicked at crates/nestweaver-daemon/src/lifecycle.rs:3242:13:
assertion failed: matches!(read_effective_config_binding("errors"),
    Err(EffectiveConfigBindingError::Corrupt { .. }))

failures:
    lifecycle::tests::effective_config_binding_paths_are_isolated_per_instance
    lifecycle::tests::effective_config_binding_replacement_leaves_one_complete_record
    lifecycle::tests::effective_config_binding_reports_absent_corrupt_version_and_pid_errors
    lifecycle::tests::effective_config_binding_retries_stale_temp_name_collision
    lifecycle::tests::effective_config_binding_roundtrips_configured_and_defaults

test result: FAILED. 276 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 22.44s

*** result: Failure(101)
